RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing.c
/***************************************************************************//**
* \file cy_capsense_sensing.c
* \version 3.0
*
* \brief
* This file consists of common parts for different supported platforms
* like fourth and fifth generation platforms.
*
********************************************************************************
* \copyright
* Copyright 2021, Cypress Semiconductor Corporation (an Infineon company)
* or an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_capsense_common.h"
#include "cycfg_capsense_defines.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_sensing.h"
#include "cy_gpio.h"
#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    #include "cy_capsense_sensing_v2.h"
#else /* (CY_CAPSENSE_PSOC4_FIFTH_GEN) */
    #include "cy_capsense_sensing_v3.h"
    #include "cy_capsense_generator_v3.h"
#endif

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3))


/*******************************************************************************
* Function Name: Cy_CapSense_ScanWidget
****************************************************************************//**
*
* Initiates the scanning of all sensors in the widget. Scanning is
* initiated only if no scan is in progress. Scan finishing can be
* checked by the Cy_CapSense_IsBusy() function.
*
* \note
* For the fifth-generation CAPSENSE&trade; this function is available in
* single-channel solution only. It is recommended to use
* the Cy_CapSense_ScanSlots() function instead for compatibility with
* further CAPSENSE&trade; middleware versions.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation \ref cy_capsense_status_t.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanWidget(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        return Cy_CapSense_ScanWidget_V3(widgetId, context);
    #else /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */
        return Cy_CapSense_ScanWidget_V2(widgetId, context);
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
}

/*******************************************************************************
* Function Name: Cy_CapSense_ScanSensor
****************************************************************************//**
*
* Initiates the scanning of the selected sensor in the widget. Scanning is
* initiated only if no scan is in progress. Scan finishing can be
* checked by the Cy_CapSense_IsBusy() function.
*
* \note
* For the fifth-generation CAPSENSE&trade; this function is available in
* single-channel solution. It is recommended to use
* the Cy_CapSense_ScanSlots() function instead for compatibility with
* further CAPSENSE&trade; middleware versions.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget. A macro for the
* sensor ID within a specified widget can be found in the cycfg_capsense.h
* file defined as CY_CAPSENSE_<WIDGET_NAME>_SNS<SENSOR_NUMBER>_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation \ref cy_capsense_status_t.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanSensor(
                uint32_t widgetId,
                uint32_t sensorId,
                cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        return Cy_CapSense_ScanSensor_V3(widgetId, sensorId, context);
    #else /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */
        return Cy_CapSense_ScanSensor_V2(widgetId, sensorId, context);
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
}


/*******************************************************************************
* Function Name: Cy_CapSense_ScanAllWidgets
****************************************************************************//**
*
* Initiates scanning of all enabled widgets (and sensors) in the project.
* Scanning is initiated only if no scan is in progress.
*
* This function initiates a scan only for the first sensor in the first widget
* for the fourth-generation CAPSENSE&trade; or a scan for the first slot
* for the fifth-generation CAPSENSE&trade; and then exits the function. The scan
* for the remaining sensors(slots) are initiated in the interrupt-driven mode
* in the interrupt service routine (part of middleware) triggered at the end
* of each scan completion or by DMA controllers in the DMA mode. The status
* of the current scan should be checked by using the Cy_CapSense_IsBusy() and wait
* until all scans is finished prior to starting a next scan or initializing
* another widget.
*
* \note
* For the fifth-generation CAPSENSE&trade; it is recommended to use
* the Cy_CapSense_ScanAllSlots() function instead for compatibility with
* further CAPSENSE&trade; middleware versions.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation \ref cy_capsense_status_t.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanAllWidgets(
                cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        return Cy_CapSense_ScanAllWidgets_V3(context);
    #else /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */
        return Cy_CapSense_ScanAllWidgets_V2(context);
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
}


