RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing.c
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN)
            switch(inactiveState)
            {
                case CY_CAPSENSE_SNS_CONNECTION_GROUND:
                    inactiveStateEn = CY_CAPSENSE_BIST_IO_STRONG_E;
                    break;
                case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                    inactiveStateEn = CY_CAPSENSE_BIST_IO_HIGHZA_E;
                    break;
                case CY_CAPSENSE_SNS_CONNECTION_SHIELD:
                    inactiveStateEn = CY_CAPSENSE_BIST_IO_SHIELD_E;
                    break;
                default:
                    inactiveStateEn = CY_CAPSENSE_BIST_IO_UNDEFINED_E;
                    break;
            }

            if ((CY_CAPSENSE_BIST_CSD_GROUP == sensingGroup) &&
                ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_SHIELD == inactiveState)))
            {
                if(context->ptrBistContext->intrEltdCapCsdISC != inactiveStateEn)
                {
                    context->ptrBistContext->intrEltdCapCsdISC = inactiveStateEn;
                }
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
            }

            if ((CY_CAPSENSE_BIST_CSX_GROUP == sensingGroup) &&
                ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState)))
            {
                if(context->ptrBistContext->intrEltdCapCsxISC != inactiveStateEn)
                {
                    context->ptrBistContext->intrEltdCapCsxISC = inactiveStateEn;
                }
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
            }

            if ((CY_CAPSENSE_BIST_SHIELD_GROUP == sensingGroup) &&
                ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_SHIELD == inactiveState)))
            {
                if(context->ptrBistContext->intrEltdCapShieldISC != inactiveStateEn)
                {
                    context->ptrBistContext->intrEltdCapShieldISC = inactiveStateEn;
                }
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
            }
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) */

        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
            for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
            {
                context->ptrActiveScanSns[curChIndex].currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;

                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
                    if ((CY_CAPSENSE_STATUS_SUCCESS == capStatus) &&
                        ((CY_CAPSENSE_CSD_GROUP == sensingGroup) ||
                         (CY_CAPSENSE_CSX_GROUP == sensingGroup)))
                    {
                        Cy_CapSense_GenerateAllSensorConfig(curChIndex, &context->ptrSensorFrameContext[(CY_CAPSENSE_SLOT_COUNT *
                                    (curChIndex + context->ptrCommonConfig->channelOffset)) * CY_MSC_6_SNS_REGS], context);
                    }
                #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */

            }
        #endif
    }
    return (capStatus);
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_SetCsdInactiveState
****************************************************************************//**
*
* Sets a desired pin state for all inactive CAPSENSE&trade;-related electrodes for CSD
* scans.
*
* There is the internal function and it is not recommended to call it directly
* from the application program. The function sets the desired state of all
* CSD group CAPSENSE&trade;-related electrodes which are not scanned.
* The function updates some corresponding parameters in the CAPSENSE&trade; Data
* Structure to provide the desired state and not changes pin state immediately.
* The desired state will be applied to all inactive electrodes during the CSD scan.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetCsdInactiveState(
             cy_stc_capsense_context_t * context)
{
    context->ptrInternalContext->csdInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
    switch (context->ptrInternalContext->intrCsdInactSnsConn)
    {
        case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
            context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
            break;

        case CY_CAPSENSE_SNS_CONNECTION_SHIELD:
            context->ptrInternalContext->csdInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD;
            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
                if (CY_CAPSENSE_SHIELD_ACTIVE == context->ptrCommonConfig->csdShieldMode)
                {
                    context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
                }
                else
                {
                    context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
                }
            #endif

            #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
                context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_SHIELD;
            #endif
            break;

        case CY_CAPSENSE_SNS_CONNECTION_GROUND:
            /* CY_CAPSENSE_SNS_CONNECTION_GROUND */
            context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            break;

        default:
            /* Set the default pin state: High-Z */
            context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
            break;
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_SetCsxInactiveState
****************************************************************************//**
*
* Sets a desired pin state for all inactive CAPSENSE&trade;-related electrodes for CSX
* scans.
*
* There is the internal function and it is not recommended to call it directly
* from the application program. The function sets the desired state of all
* CSX group CAPSENSE&trade;-related electrodes which are not scanned.
* The function updates some corresponding parameters in the CAPSENSE&trade; Data
* Structure to provide the desired state and not changes pin state immediately.
* The desired state will be applied to all inactive electrodes during the CSX scan.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetCsxInactiveState(
             cy_stc_capsense_context_t * context)
{
    context->ptrInternalContext->csxInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
    switch (context->ptrInternalContext->intrCsxInactSnsConn)
    {
        case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
            context->ptrInternalContext->csxInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
            break;
        case CY_CAPSENSE_SNS_CONNECTION_GROUND:
            /* CY_CAPSENSE_SNS_CONNECTION_GROUND */
            context->ptrInternalContext->csxInactiveSnsDm = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            break;
        case CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2:
            /* CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 */
            context->ptrInternalContext->csxInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_AMUXB;
            context->ptrInternalContext->csxInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
            break;
        default:
            /* Set the default pin state: High-Z */
            context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
            break;
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3)) */
/* [] END OF FILE */
